Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: བྱིས་པ་གཞོན་ནུ་སྐྲ་ནག་པ། དང་པོའི་ལང་ཚོ་དང་ལྡན་པ། ན་ཚོད་དར་ལ་བབ་པ།
en: He was a young boy with black hair, in the first stage of youth.

source: འདོད་པ་ལ་རྣམ་པར་མ་རྩེས་ཤིང་། །གཞོན་ནུར་ཚངས་པར་སྤྱད་པ། བསྙེན་པར་རྫོགས་ནས་ལོ་གཅིག་ལོན་པ་ཞིག་ཡོད་དོ།
en: He had become a youth who did not indulge in desires, but was a young celibate, who had been keeping the vow for a year.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔལ་དབྱངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་དག་ལ་གསོལ་བ་བཏབ་པ། །འདི་ལྟ་སྟེ།
en: “Young man, at that time, King Śrīghoṣa made a request to that great assembly of bodhisattvas.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པ་ཡང་དག་པར་སྡུད་པ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་གཟུངས་ཆེན་པོ་དང་། ཐབས་ལ་མཁས་པ་དང་། དབང་དང་འདུལ་བ་ཆགས་པ་མེད་པ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་གསོལ་བ་བཏབ་ནས།
en: He made a request to those bodhisattva mahāsattvas that he might, combining the six perfections, accomplish the great retention of the bodhisattva piṭaka, skill in methods, and unimpeded power and guidance.

source: དེའི་ནུབ་མོ་མཆོད་རྟེན་དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་སྙིང་པོ་ཅན་རྣམས་ཀྱི་མདུན་དུ་མར་མེའི་ཡོན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་རབ་ཏུ་འབར་བར་བྱས་ཏེ།
en: That evening he lit a quintillion lights before the stūpas that contained the relics of the Tathāgata.

source: ཁྱམས་ཀྱི་དཀྱིལ་འཁོར་ཡང་ཕྱག་དར་བྱས་ཤིང་ཆག་ཆག་བཏབ་ནས་རབ་ཏུ་བྱུག་པ་བྱས། མེ་ཏོག་མངོན་པར་བཀྲམ་ཞིང་། མལ་སྟན་སྣ་ཚོགས་བཏིང་སྟེ།
en: He also swept clean the circumambulation walkway, moistened and washed it, scattered flowers upon it, and arranged various seats.

source: རྒྱལ་པོ་དཔལ་དབྱངས་དེ་བཙུན་མོའི་འཁོར་དང་བཅས། གྲོང་དང་ཡུལ་མི་འཁོར་དང་བཅས། གྲོང་མིར་བཅས་པ་ཁྱིམ་གྱི་ནང་ནས་བྱུང་སྟེ།
en: King Śrīghoṣa then came there accompanied by his harem and the people of the villages, towns, and regions.

source: རོལ་མོ་དང་སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཐོགས་ནས་མཆོད་རྟེན་དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་སྙིང་པོ་ཅན་རྣམས་ལ་མཆོད་པ་བྱས་ནས་ཆོས་མཉན་པའི་ཕྱིར་བཙུན་མོའི་འཁོར་དང་བཅས་ཏེ་ཁང་ཐོག་ཏུ་དོང་ངོ་།
en: Holding musical instruments, percussion instruments, cymbals, flowers, incense, perfumes, garlands, ointments, powders, robes, parasols, banners, and flags, they made offerings to the stūpa, which contained the relics of the Tathāgata. Afterwards, in order to hear the Dharma, accompanied by his harem of queens, he ascended to the roof of the palace.

source: །ལྷ་དང་མིའི་འཁོར་ཀྱང་ཆོས་ཉན་པའི་ཕྱིར་མང་དུ་ཚོགས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བདེ་བས་བྱིན་གྱིས་དེ་དག་མཐོང་བ་དང་། མར་མེའི་ཡོན་དུ་ཕུལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་དག་རབ་ཏུ་འབར་བར་བྱས་པས་དེའི་འོད་ཀྱིས་གཅིག་ཏུ་ཁྱབ་སྟེ།
en: Gatherings of devas and humans also assembled in order to hear the Dharma. “The bodhisattva Kṣemadatta saw them and the lights from the numerous quintillions of offered lamps that shone as one pervading radiance.

source: ལྷ་དང་མིའི་སྐྱེ་བོ་མང་པོ་རྣམས་ཆོས་ཉན་པར་ཚོགས་པར་རིག་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་ཡིན་ན། ད་བདག་ཏིང་ངེ་འཛིན་འདི་འདོད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཞིག་བྱ་སྟེ།
en: Knowing that many devas and humans had assembled in order to hear the Dharma, he thought, ‘I have entered the Mahāyāna, and because I now long for this samādhi I shall make an offering to the Tathāgata.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཇི་ལྟ་བུས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ངོ་མཚར་དུ་འགྱུར་བ་དང་། ཡི་རངས་པ་དང་། དགའ་བ་དང་། མགུ་བ་དང་། ཡིད་བདེ་བ་སྐྱེ་བར་འགྱུར་ཞིང་། ཆོས་ཀྱི་སྣང་བ་ཐོབ་པ་དང་། རྒྱལ་པོ་དཔལ་དབྱངས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་པ་ཐམས་ཅད་དང་ལྡན་པ་འདིའང་ཟིལ་གྱིས་མནན་ཏེ།
en: It will be such an offering to the Tathāgata that it will amaze the worlds of devas, humans, and asuras, and bring them joy, delight, pleasure, and happiness, and they will obtain the light of the Dharma.

source: རྒྱལ་པོ་དཔལ་དབྱངས་བཙུན་མོའི་འཁོར་དང་ཞབས་འབྲིང་བར་བཅས་པ་ཡང་ངོ་མཚར་དུ་གྱུར་ཅིང་ཡི་རངས་པ་དང་། རབ་ཏུ་དགའ་བ་དང་། མགུ་བ་དང་། ཡིད་བདེ་བ་སྐྱེ་བར་འགྱུར་བར་མཆོད་པར་བྱའོ་སྙམ་མོ།
en: I shall make an offering that will surpass all the offerings made to the Tathāgata by King Śrīghoṣa and amaze King Śrīghoṣa, his harem of queens, and his attendants, and bring them joy, delight, pleasure, and happiness.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་དེ་ལྟར་སེམས་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ཏེ། ཆོས་ཉན་པའི་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་འདུས་པར་རིག་ནས་དེའི་ནུབ་མོ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱི་མདུན་དུ་འདུག་ནས་ལག་པ་གཡས་པ་རས་ཀྱིས་དཀྲིས་ཏེ་འབྲུ་མར་གྱི་ནང་དུ་བཅུག་གོ།
en: “The bodhisattva mahāsattva Kṣemadatta was joyful and happy, and knowing that the great assembly of people had gathered to hear the Dharma, that evening he sat in front of the Tathāgata’s stūpa, bound his right hand in cotton, and immersed it in sesame oil.

source: །འབྲུ་མར་གྱི་ནང་དུ་བཅུག་ནས་འབར་བར་བྱས་སོ།
en: Having immersed it in sesame oil he set it alight.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་ལྷག་པའི་བསམ་པ་ལ་ཞུགས་པ།
en: “At this point the bodhisattva mahāsattva Kṣemadatta developed the supreme intention.

source: ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ཤིང་། བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་བའི་ལག་པ་གཡས་པ་དེ་ལྟར་འབར་ཡང་སེམས་དང་བཞིན་གྱི་མདོག་འགྱུར་བ་མེད་དོ།
en: He developed the supreme intention for the highest, complete enlightenment and, seeking complete enlightenment, although his right hand was burning brightly, his mind and the expression of his face remained unchanged.

source: །གཞོན་ནུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་གྱི་ལག་པ་གཡས་པ་བསྲེགས་ནས་རབ་ཏུ་འབར་ཞིང་མེར་གྱུར་ཏེ། མེ་ལྕེ་གཅིག་ཏུ་འབར་བར་གྱུར་མ་ཐག་ཏུ་དེའི་ཚེ་ས་ཆེན་པོ་འདི་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར་ཏོ།
en: “Young man, as the bodhisattva mahāsattva Kṣemadatta’s right hand burned brightly, and was transformed into a single flame, at that time this great earth shook.

source: །དེའི་ལག་པ་གཡས་པ་འབར་བར་བྱས་པའི་འོད་དེས་མར་མེ་ཡོན་དུ་ཕུལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་རྣམས་མོག་མོག་པོར་བྱས་པར་གྱུར་ཏེ། ཕྱོགས་ཐམས་ཅད་དུའང་སྣང་བ་ཆེན་པོ་བྱུང་ངོ་། །འོད་དེས་ཕྱོགས་ཐམས་ཅད་སྣང་བར་གྱུར་ཏེ།
en: The light from his burning right hand made that of the many quintillions of offering lamps seem dark, and its great illumination spread in all directions, its radiance illuminating and pervading every direction.

source: ཀུན་ཏུ་ཁྱབ་པར་གྱུར་པ་དང་། དེ་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདིའང་སྐད་འཇམ་ཞིང་ཡིད་དུ་འོང་བ་དང་ཚིག་བྱེ་བྲག་ཏུ་འཕགས་པ་དང་། ཚིག་དང་ཡི་གེ་རྒྱུན་ཆགས་པས་འཁོར་དེ་དག་ཐམས་ཅད་ལ་རྒྱ་ཆེར་གོ་བར་བྱེད་ཅིང་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: “He became joyful and happy, and with a gentle and pleasing voice, a uniquely superior vocabulary, and a continuity of words and letters, he taught the samādhi, the revealed equality of the nature of all phenomena so that the entire assembly understood it in detail.

source: །དེར་སུམ་ཅུ་རྩ་གསུམ་རིས་ཀྱི་ལྷ་ཁྲི་ཉིས་སྟོང་ཆོས་ཉན་པར་འདུས་པ་དེ་དག་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་ལྷའི་མཆོད་པ་སྣ་ཚོགས་བྱེད་པར་གྱུར་ཏོ།
en: “The one thousand two hundred Trāyastriṃśa devas assembled there to listen to the Dharma were made joyous and happy and made various divine offerings.

source: །ལྷའི་བུ་མོ་རྣམས་ཀྱང་ལྷའི་རོལ་མོ་དག་བྱེད་དོ།
en: The apsarases engaged in singing divine songs.

source: །རྒྱལ་པོ་དཔལ་དབྱངས་ཁང་པའི་སྟེང་ན་འདུག་པ་བདག་གི་མི་མང་པོས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། བཙུན་མོའི་འཁོར་གྱི་ནང་ན་འདུག་པ།
en: “King Śrīghoṣa, who was keeping the eight poṣadha vows, was in the middle of his harem of queens, with his court before him, seated on the roof of his palace.

source: གསོ་སྦྱོང་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་ཡང་དག་པར་བཟུང་བས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་གྱི་ལག་པ་འབར་བར་བྱས་ཏེ། འོད་དེ་དག་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཅིང་ལྷའི་འོད་མིའི་ལས་འདས་པས་སྣང་བར་བྱས་པ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་སོ།
en: He saw that the bodhisattva mahāsattva Kṣemadatta’s hand was burning and outshining all other lights, creating a brightness that transcended the lights of devas and the lights of humans.

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་ཆེན་པོ་ཐོབ་པ་ཡིན་ནོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་ལ་ཤིན་ཏུ་དགའ་བ་དང་། དད་པ་དང་གུས་པ་ཉེ་བར་བཞག་སྟེ།
en: “He thought, ‘This bodhisattva mahāsattva has attained great higher cognition,’ and felt intense joy, faith, veneration, and reverence for the bodhisattva mahāsattva Kṣemadatta.

source: རི་མོར་བཅས་ཤིང་དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོས་བརྟན་པས་བཙུན་མོའི་འཁོར་བརྒྱད་ཅུ་དང་ལྷན་ཅིག་ཁང་པའི་སྟེང་དེ་ནས་བདག་ཉིད་མཆོངས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་བལྟ་བ་དང་རབ་ཏུ་དགའ་བར་བྱ་བའི་ཕྱིར་མཆོངས་ཏེ་སོང་ངོ་།
en: Supported by his great accumulation of merit and roots of merit he leapt from the roof of the palace, together with his harem of eighty queens. He leapt because of his joy on having seen the bodhisattva mahāsattva Kṣemadatta.

source: །དེ་གུས་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བས་ཚེ་དེ་ཉིད་ལ་འཁོར་དང་བཅས་པ། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བ་ཐོབ་བོ།
en: “Because of the roots of merit that were produced by his veneration, he and his retinue were caught by devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: །དེ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དག་གིས་ཡོངས་སུ་བཟུང་བས་རྒྱལ་པོ་དཔལ་དབྱངས་ཀྱང་འཁོར་དང་བཅས་པ་ཁྲུ་སྟོང་ཕྲག་བརྒྱར་ཚང་བའི་ཁང་པའི་སྟེང་ནས་མཆོངས་ན་དེའི་ལུས་ལ་གནོད་པའམ། སེམས་ལ་གནོད་པའམ། སེམས་ཞུམ་པར་གྱུར་པ་མེད་དོ།
en: After they had been caught by devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, King Śrīghoṣa and his retinue, even though they had jumped from a building that was a hundred thousand cubits high, were physically unharmed, mentally unharmed, and were not unnerved.

source: །དེ་ནས་རྒྱལ་པོ་དཔལ་དབྱངས་ལག་པ་གཉིས་བསྒྲེང་སྟེ། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་ལྷན་ཅིག་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་གྱི་ལག་པ་བསྲེགས་ཤིང་རབ་ཏུ་འབར་བ་མཐོང་ནས་སྐད་ཆེན་པོ་ཕྱུང་སྟེ་ཆོ་ངེས་བཏབ་བོ།
en: “King Śrīghoṣa extended both his hands, and together with the great assembly of people saw the bodhisattva mahāsattva Kṣemadatta’s hand on fire and burning brightly. All of them cried out loudly and wailed.

source: །དེ་ནས་རྒྱལ་པོ་དེ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་ལྷན་ཅིག་ངུ་ཞིང་མཆི་མ་ཕྱུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་གྱི་མདུན་དུ་འདུག་གོ།
en: Then the king, together with the great assembly of people, weeping and shedding tears, came before the bodhisattva mahāsattva Kṣemadatta.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་གྱིས་རྒྱལ་པོ་དཔལ་དབྱངས་མཐོང་སྟེ། མཐོང་ནས་དེ་ལ་སྨྲས་པ། ཅིའི་སླད་དུ་རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་འདི་དག་དང་བདག་གི་མདུན་ན་བཞུགས་ཤིང་སྐད་ཆེན་པོ་ཕྱུང་སྟེ། ཆོ་ངེས་བཏབ་ནས་བཤུམས་ཤིང་མཆི་མ་འབྱིན་པ་མཛད།
en: “Young man, the bodhisattva mahāsattva Kṣemadatta saw King Śrīghoṣa, and having seen him asked, ‘Great king, why are you and this great assembly of people here before me crying out loudly, wailing, sorrowful, and weeping?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། རྒྱལ་པོ་དཔལ་དབྱངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་སྨྲས་པ།
en: “King Śrīghoṣa spoke these verses to the bodhisattva mahāsattva Kṣemadatta: “ ‘These beings have cried out Because they have seen that Kṣemadatta,

source: ཤེས་རབ་ཆེན་པོ་བདེ་བས་བྱིན། །ཆོས་སྨྲ་བ་ནི་མཁས་པ་ཡི།
en: The one with great wisdom, the learned one,

source: །ཡན་ལག་མ་ཚང་རིག་ནས་ནི།
en: The dharmabhāṇaka, has lost a limb. {1}

source: །སྐྱེ་བོ་འདི་དག་དེ་ཕྱིར་དུ།
en: “ ‘Seeing that this body

source: །གཟི་བརྗིད་ཕུང་པོས་འཕགས་པ་ཡི། །འདི་ལྟ་བུ་ཡི་གཟུགས་འདི་ཡང་།
en: That emits this brilliant light

source: །ལག་པ་ཉམས་པར་ཤེས་ནས་ནི།
en: Has had a hand destroyed,

source: །བདག་ཀྱང་ཤིན་ཏུ་སྡུག་བསྔལ་ལོ།
en: I also feel great suffering. {2}

source: །ཁྱོད་ཀྱི་ལག་པ་འབར་བྱས་པ།
en: “ ‘The light from your burning hand

source: །དེ་ཡི་འོད་ནི་ཕྱོགས་བཅུར་བཏང་།
en: Has shone into the ten directions.

source: །ཁྱོད་ལས་བྱུང་བའི་ལྷ་རྫས་ཀྱིས།
en: The divine light you have emitted

source: །མར་མེ་འདི་དག་མི་གསལ་བྱས།
en: Has obscured the light of these lamps. {3}

source: །ས་འདི་རབ་ཏུ་གཡོས་གྱུར་ཏེ།
en: “ ‘This earth has been shaken

source: །ཁྱོད་ཀྱི་སེམས་ནི་ཞུམ་པ་མེད།
en: And you are not disheartened.

source: །དེ་ནས་བདག་གི་སེམས་སྐྱེས་པ། །མཁས་པ་ཐ་མལ་མ་ཡིན་སྙམ།
en: There arose in me the thought, “That is no ordinary wise man.” {4} “ ‘I leapt a hundred thousand cubits From the roof of my palace,

source: །བདག་ནི་བཙུན་མོའི་འཁོར་བཅས་པ། །ཁྲུ་ནི་སྟོང་ཕྲག་བརྒྱ་པ་ཡི། །ཁང་པའི་སྟེང་ནས་མཆོངས་གྱུར་ན།
en: Together with my harem of queens,

source: །བདག་གི་ལུས་ལ་གནོད་པ་མེད།
en: But my body was not harmed. {5}

source: །ལེགས་སོ་ཡེ་ཤེས་ངོ་མཚར་ཁྱོད།
en: “ ‘How excellent your wonderful wisdom!

source: །ལེགས་སོ་སེམས་ཀྱང་བླ་ན་མེད།
en: How excellent your unsurpassable mind!

source: །བརྩོན་འགྲུས་རབ་བརྩམས་ལེགས་པ་སྟེ།
en: How excellent your dedicated diligence!

source: །བསམ་པ་ཆེ་བ་ལེགས་པ་ཡིན།
en: How excellent your great aspiration! {6}

source: །གང་གི་ལག་པ་འབར་བྱས་ཀྱང་།
en: “ ‘Your hand is burning

source: །ཁྱོད་ལ་ནམ་ཡང་གཡོ་བ་མེད།
en: But you are not disturbed.

source: །དགའ་ཞིང་རངས་པ་སྐྱེས་ནས་སུ།
en: You are happy and joyous

source: །ཕྱིར་ཡང་ཆོས་ནི་རབ་ཏུ་འཆད།
en: And again teach the Dharma. {7} “ ‘Worthy friend, you are as beautiful

source: །ཇི་ལྟར་ཟླ་བ་ཉ་བ་དང་། །ནམ་མཁའི་དཀྱིལ་ན་ཉི་མ་བཞིན།
en: As the moon that is full, Or the sun high in the sky,

source: །རི་རབ་རི་ཡི་རྒྱལ་པོ་ལྟར། །གྲོགས་པོ་དེ་ལྟར་ཤིན་ཏུ་མཛེས།
en: Or Sumeru, the king of mountains. {8}

source: །བདག་ཀྱང་དེ་བཞིན་མཁས་པ་ཡི།
en: “ ‘Wise one, may I also

source: །སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བགྱི།
en: Fulfill such a prayer!

source: །ལུས་ལ་ཕངས་པ་རབ་སྤངས་ཏེ།
en: Rejecting my care for the body

source: །བདག་གིས་སྲོག་ཆགས་དོན་རྣམས་བགྱིད།
en: I will accomplish benefit for beings. {9}

source: །ཆོས་ཀྱི་དགའ་བས་རངས་གྱུར་ཏེ།
en: “ ‘I delight in joy for the Dharma;

source: །བདག་གི་དགའ་བ་བསམ་མི་ཁྱབ།
en: My happiness in that is inconceivable.

source: །འདི་ལྟར་ཡན་ལག་མ་ཚང་བ།
en: That you have lost a limb

source: །དེས་ནི་རབ་ཏུ་སྡུག་བསྔལ་ལོ།
en: Causes me the highest suffering.’ {10}

source: །ལྷ་དང་ཀླུ་ཡི་མཆོད་པ་ཡིས།
en: “Kṣemadatta, through devas and nāgas,

source: །བདེ་བས་བྱིན་གྱིས་རྒྱལ་པོ་ལ།
en: Made offerings to the king

source: །མཐའ་ཡས་པ་ཡི་སྤོབས་པ་ཡིས། །ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས།
en: And he spoke these verses With infinite confidence: {11}

source: །གང་ལ་ལག་པ་མེད་པ་ཡང་།
en: “ ‘Someone who has no hand

source: །དེ་ནི་ཡན་ལག་མ་ཚང་མིན།
en: Is not the one who lacks a limb;

source: །སུ་ལ་ཚུལ་ཁྲིམས་མེད་པ་དག །དེ་ནི་ཡན་ལག་མ་ཚང་ཡིན། །རུས་པ་ཡི་ནི་ལུས་འདི་ཡིས།
en: Someone who has no correct conduct Is the one who is lacking a limb. {12} “ ‘This putrid body of mine I have offered to the tathāgatas,

source: །བསམ་གྱིས་མི་ཁྱབ་སྦྱིན་པའི་གནས།
en: The inconceivable recipients of offerings,

source: །འཇིག་རྟེན་ཀུན་གྱི་མཆོད་པའི་རྟེན།
en: The ones to whom offerings should be made by all the world. {13} . “ ‘Seeking the wisdom of buddhahood

source: །དེ་བཞིན་གཤེགས་པ་བདག་གིས་མཆོད།
en: I offer to the lords of the worlds

source: །སྟོང་གསུམ་དག་ནི་མཐའ་ཡས་པ།
en: Infinite billion-world universes

source: །རིན་པོ་ཆེ་ཡིས་ཡོངས་བཀང་སྟེ། །སངས་རྒྱས་ཡེ་ཤེས་ཚོལ་བའི་ཕྱིར།
en: Entirely filled with jewels. {14}

source: །འཇིག་རྟེན་མགོན་ལ་རབ་ཏུ་སྦྱིན།
en: “ ‘There are these material offerings

source: །འཇིག་རྟེན་པ་ཡི་མཆོད་ཡོད་ཀྱང་།
en: But there are other inconceivable offerings.

source: །སུ་དག་ཆོས་རྣམས་སྟོང་རིག་ནས།
en: Those who know that phenomena are empty

source: །ལུས་དང་སྲོག་ཀྱང་གཏོང་བ་ཡི། །མཆོད་པ་དེ་དག་བསམ་མི་ཁྱབ།
en: Give away their bodies and their lives. {15}

source: །བདེན་པའི་ཚིག་ནི་བརྗོད་པར་བགྱི། །རྒྱལ་པོ་ཆེན་པོ་བདག་ལ་གསོན།
en: “ ‘I shall speak words of truth. Great king, listen to me!

source: །སྐྱེ་བོའི་ཚོགས་འདི་ཐམས་ཅད་ཀྱང་།
en: All the people gathered here,

source: །ཚིགས་བཅད་འདི་ཡི་དོན་རིག་བགྱི།
en: Understand the meaning of these verses! {16}

source: །བདེན་པ་གང་གིས་སངས་རྒྱས་སུ།
en: “ ‘If it is true that I will become a buddha,

source: །འཇིག་རྟེན་མཆོད་རྟེན་བདག་འགྱུར་ན།
en: One who is revered by the world,

source: །བདེན་པ་དེ་ཡིས་ས་འདི་ཡང་།
en: May that truth cause this earth

source: །རྣམ་པ་དྲུག་ཏུ་གཡོས་གྱུར་ཅིག །ཚིག་འདི་དག་ནི་སྨྲས་པ་དང་། །ས་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར།
en: To shake in six ways!’ {17} “He spoke those words And the earth shook.

source: །ངོ་མཚར་གྱུར་ཅིང་རྨད་བྱུང་སྟེ། །ལྷ་རྣམས་བྱེ་བ་རབ་ཏུ་དགའ།
en: Millions of devas were overjoyed, Amazed, and astonished. {18}

source: །ལྷ་དང་མི་དག་དགའ་ནས་ནི།
en: “The joyous devas and humans

source: །བྱང་ཆུབ་ཏུ་ཡང་སེམས་བསྐྱེད་དེ།
en: Developed the aspiration for enlightenment.

source: །ཐེག་པ་མཆོག་ལ་གནས་པར་གྱུར།
en: Were established in the supreme yāna. {19} “The benefit accomplished

source: །དགེ་སློང་བདེ་བས་བྱིན་པ་ཡིས། །ཇི་སྙེད་ཀྱི་ནི་དོན་བྱས་པ།
en: By the bhikṣu Kṣemadatta

source: །དེ་ནི་མི་ཟད་བསམ་མི་ཁྱབ།
en: Is the unending and inconceivable engagement

source: །སངས་རྒྱས་དག་གི་ཡེ་ཤེས་འཇུག །བདེན་པ་གང་གིས་ཆོས་དེ་ནི།
en: With the wisdom of the buddhas. {20} “ ‘If it is true that this phenomenon

source: །ལག་པ་ཞེས་ཀྱང་བྱ་མེད་ན།
en: That is called “hand” does not exist,

source: །བདེན་པ་དེ་ཡིས་སྔོན་ལྟར་བདག །ལག་པ་མྱུར་དུ་བྱུང་བར་ཤོག །བདེན་པ་གང་གིས་ཆོས་དེ་ནི།
en: Then may that truth cause my hand To be instantly restored as it was before! {21} “ ‘If it is true that this phenomenon

source: །བདེ་བས་བྱིན་པ་ཡོད་མ་ཡིན།
en: Called “Kṣemadatta” does not exist,

source: །ཕྱོགས་བཅུ་རྣམས་སུ་བཙལ་ན་ཡང་།
en: Though one seeks for it in the ten directions,

source: །སྟོང་པ་ཡིན་པས་མི་དམིགས་སོ།
en: It will be not be found, because it is empty. {22}

source: །སྒྲ་གང་འབྱུང་བར་འགྱུར་བ་ཡང་།
en: “ ‘Whatever sound arises,

source: །དེ་ནི་སྟོང་པར་རིག་པར་གྱིས།
en: Know it to be empty.

source: །ཆོས་རྣམས་དེ་ལྟར་ཤེས་པར་གྱིས།
en: Know phenomena to be like that. {23}

source: །ནམ་ཞིག་འཇིགས་པ་མེད་འགྱུར་ཞིང་།
en: “ ‘When there is fearlessness,

source: །སྟོང་པ་རྟོགས་པར་ཁོང་དུ་ཆུད།
en: Emptiness is fully comprehended.

source: །བདེན་པ་ཡི་ནི་ཚིག་དེ་ཡིས།
en: Through those words of truth

source: །འཇིག་རྟེན་ཐམས་ཅད་འཚིག་མི་འགྱུར།
en: May the entire world not be burned! {24}

source: །སྲིད་གསུམ་སེམས་ཅན་ཇི་སྙེད་པ།
en: “ ‘May all the beings in the three existences,

source: །ལྷ་རྣམས་དང་ནི་མི་རྣམས་ཀྱང་།
en: The devas and the humans, All rest in a state of meditation

source: །ཐམས་ཅད་མཁྱེན་པའི་གཟི་བརྗིད་ཀྱིས།
en: Because of the brilliance of omniscience. {25} “ ‘All the misfortunes

source: །ཐམས་ཅད་མཉམ་པར་བཞག་པར་ཤོག །ཇི་སྙེད་ལྷ་དང་མི་དག་གིས།
en: That devas and humans have,

source: །འཚེ་བར་གྱུར་པ་ཅི་ཡོད་པ།
en: May they all come to cessation

source: །ཕྱིར་མི་ལྡོག་པའི་གཟི་བརྗིད་ཀྱིས། །དེ་དག་ཐམས་ཅད་ཞི་བར་ཤོག །ཚིགས་བཅད་འདི་དག་བཤད་པ་དང་། །ལག་པ་ཡང་ནི་སླར་སྐྱེས་ཏེ།
en: Through the brilliance of irreversibility!’ {26} “After Kṣemadatta spoke those verses His hand grew back,

source: །བདེ་བས་བྱིན་པ་དེ་ཡི་ལུས།
en: And Kṣemadatta’s body became

source: །མཚན་རྣམས་ཀྱིས་ནི་རྣམ་པར་བརྒྱན།
en: Adorned by the primary signs. {27}

source: །ལྷ་ཡང་བྱེ་བ་ཕྲག་སྟོང་རྣམས།
en: “Ten thousand million devas

source: །བར་སྣང་ལ་ནི་འདུག་ནས་སུ།
en: Who were residing in the sky Threw down at that moment

source: །དེ་ཚེ་མེ་ཏོག་མན་དཱ་རས། །དགེ་སློང་དེ་ལ་འཐོར་བར་བྱེད།
en: Coral tree flowers upon the bhikṣu. {28}

source: །མི་མ་ཡིན་པའི་མེ་ཏོག་གིས།
en: “Those divine flowers

source: །འཛམ་བུའི་གླིང་འདི་གང་བར་གྱུར།
en: Filled up this world.

source: །ལྷ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས།
en: A quintillion apsarases

source: །གླུ་དབྱངས་རོལ་མོ་རབ་ཏུ་བྱེད།
en: Engaged in performing songs. {29}

source: །དེ་ཚེ་བདེ་བས་བྱིན་པ་ཡིས།
en: “When Kṣemadatta

source: །སྒྲ་འདི་དག་ནི་ཕྱུང་བ་ན།
en: Emitted these words,

source: །རྣམ་འཕྲུལ་འདི་ནི་སངས་རྒྱས་དག །བྱེ་བ་སྟོང་གིས་གཟིགས་པར་འགྱུར།
en: Ten thousand million buddhas Witnessed this miracle. {30}

source: །རང་རང་གི་ནི་ཞིང་དག་ཏུ། །དགེ་སློང་ཕ་དང་དགེ་སློང་མ།
en: “In each of their realms

source: །དགེ་བསྙེན་མ་དང་དགེ་བསྙེན་ལ། །གྲགས་པ་ཆེན་པོ་གོ་བར་མཛད།
en: They made his great fame known To their bhikṣus and bhikṣuṇīs, Upāsakas and upāsikās: {31}

source: །དགེ་སློང་བདེ་བས་བྱིན་པ་དེ།
en: “ ‘This bhikṣu Kṣemadatta

source: །མཁས་ཤིང་སྟོབས་ཀྱང་ཆེ་བ་སྟེ།
en: Is wise and has great might.

source: །སངས་རྒྱས་ཀྱི་ནི་ཡེ་ཤེས་ཕྱིར། །དེས་ནི་ལག་པ་འབར་བར་བྱས།
en: He burned his hand in order to gain The wisdom of buddhahood.’ {32}

source: །དེ་ཡིས་ཞིང་རྣམས་སྟོང་དག་དང་། །གང་གཱ་ཡི་ནི་བྱེ་མ་སྙེད།
en: “Thousands of realms, As numerous as the Ganges sands,

source: །མར་མེ་དེས་ནི་སྣང་བྱས་ཏེ།
en: Were illuminated by that lamp,

source: །སྲེག་པའི་བསྐལ་པ་བྱུང་བ་བཞིན།
en: Which was like the fire at an eon’s end. {33}

source: །མེ་ཏོག་དང་ནི་ཕྱེ་མ་ཡིས། །ཞིང་རྣམས་ཐམས་ཅད་གང་བར་གྱུར།
en: “All the realms became filled With flowers and sandalwood powder,

source: །ས་གཞི་དག་ནས་ཡན་ཆད་དུ། །པུས་ནུབ་ཙམ་དུ་གང་བར་གྱུར།
en: Up to kneeheight From the ground. {34}

source: །རིན་ཆེན་མེ་ཏོག་ཐམས་ཅད་ཀྱིས།
en: “Jewels and flowers of every kind

source: །སངས་རྒྱས་ཞིང་ནི་གང་བར་གྱུར། །བདེ་བས་བྱིན་ལ་མཆོད་པའི་ཕྱིར།
en: Filled the buddha realm.

source: །ཀླུ་རྣམས་མུ་ཏིག་ཆར་པ་འབེབས།
en: Nāgas brought down a rain of pearls As an offering to Kṣemadatta. {35} “This realm became adorned

source: །རིན་ཆེན་བཀོད་པ་ཐམས་ཅད་ཀྱིས། །ཞིང་འདི་རབ་ཏུ་བརྒྱན་པར་གྱུར། །བདེ་བས་བྱིན་ལ་མཆོད་པའི་ཕྱིར།
en: By a display of every kind of jewel.

source: །མུ་ཏིག་རིན་ཆེན་ཤིན་ཏུ་བཀྲམ།
en: Jewels and pearls were spread out As an offering to Kṣemadatta. {36}

source: །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །མི་འམ་ཅི་དང་ལྟོ་འཕྱེར་བཅས།
en: “Devas, nāgas, and yakṣas, kinnaras and mahoragas,

source: །བྱང་ཆུབ་མཆོག་ལ་ཞུགས་པར་གྱུར།
en: Were established in the highest enlightenment.” {37} The Śākya lion, the Buddha,

source: །བྱ་རྒོད་སྤུངས་པའི་རི་ལ་ཡང་། །སངས་རྒྱས་ཤཱཀྱ་སེང་གེ་ནི།
en: Was on Vulture Peak Mountain.

source: །དགེ་སློང་དག་གི་དགེ་འདུན་མདུན།
en: In front of his assembly of bhikṣus

source: །རྒྱལ་བ་སེང་གེའི་སྒྲ་སྒྲོག་པ།
en: The Jina roared this lion’s roar: {38} “It is I who was Kṣemadatta And Ajita was Śrīghoṣa.

source: །བསྐལ་པ་བྱེ་བ་སྟོང་དུ་ནི།
en: For ten thousand million eons

source: །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པ་ན། །ང་ནི་བདེ་བས་བྱིན་པར་གྱུར། །མ་ཕམ་པ་ནི་དཔལ་དབྱངས་ཡིན།
en: I practiced the bodhisattva conduct. {39}

source: །དགེ་སློང་བདེ་བས་བྱིན་པ་ནི།
en: “Countless women,

source: །མཐོང་མ་ཐག་ཏུ་དེ་ཡི་ཚེ།
en: The moment they saw Bhikṣu Kṣemadatta,

source: །བུད་མེད་དག་ཀྱང་མཐའ་ཡས་པ།
en: Ceased being women. {40}

source: །བུད་མེད་དངོས་པོ་རྣམ་པར་ལོག །མི་དབང་གིས་ནི་ལུང་བསྟན་ཏེ།
en: “The Lord of humans prophesied

source: །དེ་དག་ཕྱིར་ཡང་ལྡོག་པ་མེད།
en: That they would not return But that they all would become

source: །འཇིག་རྟེན་ཀུན་གྱི་འདྲེན་པ་སྟེ། །རང་འབྱུང་འགྱུར་ཞེས་ལུང་ཡང་བསྟན། །སྦྱངས་པའི་ཡོན་ཏན་བསྟན་པ་ཡི།
en: Self-arisen guides of the world. {41}

source: །མཁས་པས་མདོ་སྡེ་འདི་ཐོས་ནས།
en: “The wise who have heard this sūtra, The teaching on the disciplines of mendicancy,

source: །ལུས་ལ་ཕངས་པར་མ་བྱེད་པར།
en: Should have no cherishing for the body

source: །ཆོས་འདི་རྗེས་སུ་བསླབ་པར་གྱིས།
en: And should study well this Dharma.” {42}

source: །བདེ་བས་བྱིན་གྱི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་བཞི་པའོ།། །།
en: Conclusion of the thirty-fourth chapter, “Kṣemadatta.” Jñānāvatī Chapter 35

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་དགེ་བའི་རྩ་བ་རྣམས་ལ་ཉེ་བར་གནས་ན་ཆོས་ཀྱི་སྦྱིན་པའམ་ཟང་ཟིང་གི་སྦྱིན་པ་ལ་བརྩོན་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should plant roots of merit and apply themselves to practicing generosity through the Dharma or generosity through material things.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སྦྱིན་པ་དེ་ཡང་བསྔོ་བ་བཞིས་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Those bodhisattva mahāsattvas should dedicate that generosity through four prayers of dedication. “What are the four dedication prayers?
